Lakukan proses manipulasi dataframe sehingga dataframe akhir yang dimiliki teman-teman memiliki susunan column sebagai berikut :
first_name | last_name | salary | departments_name | city
serta diurutkan dari salary yang paling besar

Atau singkatnya :

a. code untuk menghubungkan Python ke database sandbox (psycopg2)

b. code sekaligus query SQL untuk memanggil data :

     - employees

     - departments

     - locations

c. code untuk melakukan manipulasi (merge, filter, sort_value) sehingga mendapatkan dataframe yang diinginkan

#Versi 1

In [ ]:
import psycopg2
#create connection
connection = psycopg2.connect(host = "digitalskoladb.c04me33o8tni.ap-southeast-1.rds.amazonaws.com",
                              port = 5432,
                              database = "sandbox",
                              user = "group_06",
                              password = "jJwz9KL22x4Prb3LXEJw23HYT")

/usr/local/lib/python3.7/dist-packages/psycopg2/__init__.py:144: UserWarning: The psycopg2 wheel package will be renamed from release 2.8; in order to keep installing from binary please use "pip install psycopg2-binary" instead. For details see: <http://initd.org/psycopg/docs/install.html#binary-install-from-pypi>.
  """)

In [ ]:
sql = """
    with location as
    (select dept.department_id, loc.city
    from datasource.departments dept
    left join datasource.locations loc on dept.location_id = loc.location_id
    )
    select emp.first_name, emp.last_name, emp.salary, dept.department_name, loc.city
    from datasource.employees emp
    left join datasource.departments dept on emp.department_id = dept.department_id
    left join location loc on emp.department_id = loc.department_id
    """

In [63]:
import pandas as pd
df=pd.read_sql(sql,connection)
df.sort_values(['salary'],ascending = False)

   first_name   last_name   salary department_name                 city
0      Steven        King  24000.0       Executive              Seattle
2         Lex     De Haan  17000.0       Executive              Seattle
1       Neena     Kochhar  17000.0       Executive              Seattle
45       John     Russell  14000.0           Sales              OX9 9ZB
46      Karen    Partners  13500.0           Sales              OX9 9ZB
..        ...         ...      ...             ...                  ...
27      James      Landry   2400.0        Shipping  South San Francisco
35         Ki         Gee   2400.0        Shipping  South San Francisco
28     Steven      Markle   2200.0        Shipping  South San Francisco
36      Hazel  Philtanker   2200.0        Shipping  South San Francisco
32         TJ       Olson   2100.0        Shipping  South San Francisco

[107 rows x 5 columns]

#Versi 2

In [58]:
emp = """
    select employee_id,first_name, last_name, salary, department_id from datasource.employees
    """
dept = """
    select department_id, department_name, location_id from datasource.departments
    """
loc = """
    select location_id,city from datasource.locations
    """

In [59]:
import pandas as pd
df_emp=pd.read_sql(emp,connection)
df_dept=pd.read_sql(dept,connection)
df_loc=pd.read_sql(loc,connection)

In [70]:
df1= df_dept.merge(df_loc, how= 'left', on ='location_id')
df2= df_emp.merge(df1,how = 'left', on = 'department_id')
df2[['first_name','last_name','salary','department_name','city']].sort_values(['salary'], ascending = False)

   first_name   last_name   salary department_name                 city
0      Steven        King  24000.0       Executive              Seattle
2         Lex     De Haan  17000.0       Executive              Seattle
1       Neena     Kochhar  17000.0       Executive              Seattle
45       John     Russell  14000.0           Sales              OX9 9ZB
46      Karen    Partners  13500.0           Sales              OX9 9ZB
..        ...         ...      ...             ...                  ...
27      James      Landry   2400.0        Shipping  South San Francisco
35         Ki         Gee   2400.0        Shipping  South San Francisco
28     Steven      Markle   2200.0        Shipping  South San Francisco
36      Hazel  Philtanker   2200.0        Shipping  South San Francisco
32         TJ       Olson   2100.0        Shipping  South San Francisco

[107 rows x 5 columns]